Конфигурация отчетов/DataProcessors/ЧатЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЧатЗадачи</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СсылкаНаЗадачу</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СписокЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Конфигурация отчетов/Documents/СообщениеПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>СообщениеПользователя</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СсылкаНаПроект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СписокЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация отчетов/DataProcessors/ЧатЗадачи/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Функция ПолучитьТекстМакета()  
    Макет = ПолучитьОбщийМакет("Chat");
    Возврат Макет.ПолучитьТекст();
КонецФункции

&НаСервере
Функция ПолучитьСообщенияHTML() Экспорт
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//    "ВЫБРАТЬ
	//    |	СообщениеПользователя.Дата КАК Дата,
	//    |	СообщениеПользователя.Отправитель КАК Отправитель,
	//    |	СообщениеПользователя.ТекстСообщения КАК ТекстСообщения
	//    |ИЗ
	//    |	Документ.СообщениеПользователя КАК СообщениеПользователя
	//    |ГДЕ
	//    |	СообщениеПользователя.СсылкаНаПроект = &СсылкаНаПроект
	//    |
	//    |УПОРЯДОЧИТЬ ПО
	//    |	Дата УБЫВ";
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//Выборка = РезультатЗапроса.Выбрать();
	//
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СообщениеПользователя.СсылкаНаПроект КАК СсылкаНаПроект,
		|	СообщениеПользователя.Отправитель КАК Отправитель,
		|	СообщениеПользователя.ТекстСообщения КАК ТекстСообщения,
		|	СообщениеПользователя.Дата КАК Дата
		|ИЗ
		|	Документ.СообщениеПользователя КАК СообщениеПользователя
		|ГДЕ
		|	СообщениеПользователя.СсылкаНаПроект = &СсылкаНаПроект
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ";
	
	Запрос.УстановитьПараметр("СсылкаНаПроект", Объект.СсылкаНаЗадачу);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	

    ТекстСообщений = "";
    
    Пока Выборка.Следующий() Цикл
        ТекстСообщений = ТекстСообщений + 
            "<div class=""message"">" +
                "<div class=""message-user"">" + Выборка.Отправитель.Наименование + "</div>" +
                "<div class=""message-text"">" + Выборка.ТекстСообщения + "</div>" +
                "<div class=""message-time"">" + Формат(Выборка.Дата, "ДЛФ=DT") + "</div>" +
            "</div>";
    КонецЦикла;
    
      
    Возврат ТекстСообщений;
КонецФункции

&НаКлиенте
Процедура Обновить(Команда)
   // Получаем базовый HTML из макета
    ТекстHTML = ПолучитьТекстМакета();
    
    // Получаем HTML-код сообщений
    ТекстСообщений = ПолучитьСообщенияHTML();
    
    // Вставляем сообщения в HTML
    ТекстHTML = СтрЗаменить(ТекстHTML, "<!--MESSAGES-->", ТекстСообщений);
    
    // Перезаписываем содержимое
    Элементы.ПолеHTML.Документ.open();
    Элементы.ПолеHTML.Документ.write("");
    Элементы.ПолеHTML.Документ.close();
    Элементы.ПолеHTML.Документ.write(ТекстHTML);
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьЧат()
   // Получаем базовый HTML из макета
    ТекстHTML = ПолучитьТекстМакета();
    
    // Получаем HTML-код сообщений
    ТекстСообщений = ПолучитьСообщенияHTML();
    
    // Вставляем сообщения в HTML
    ТекстHTML = СтрЗаменить(ТекстHTML, "<!--MESSAGES-->", ТекстСообщений);
    
    // Перезаписываем содержимое
    Элементы.ПолеHTML.Документ.open();
    Элементы.ПолеHTML.Документ.write("");
    Элементы.ПолеHTML.Документ.close();
    Элементы.ПолеHTML.Документ.write(ТекстHTML);
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
  	ТекстHTML = ПолучитьТекстМакета();
    ТекстСообщений = ПолучитьСообщенияHTML();
    ТекстHTML = СтрЗаменить(ТекстHTML, "<!--MESSAGES-->", ТекстСообщений);
    
    Элементы.ПолеHTML.Документ.open();
    Элементы.ПолеHTML.Документ.write("");
    Элементы.ПолеHTML.Документ.close();
    Элементы.ПолеHTML.Документ.write(ТекстHTML);
КонецПроцедуры


&НаСервере
Процедура ОтправитьСообщениеНаСервере()

	ТекстСообщения = Элементы.ПолеВводаСообщения.Родитель.ПолеВводаСообщения;
	Если ПустаяСтрока(ТекстСообщения) = Истина Тогда
		Возврат;
	КонецЕсли;
	Документы.СообщениеПользователя.ЗаписатьСообщениеПользователя(ТекстСообщения,ПодготовкаДанных.ПолучениеПользователяПоСеансу(), Объект.СсылкаНаЗадачу);	
КонецПроцедуры


&НаКлиенте
Процедура ОтправитьСообщение(Команда)
	ОтправитьСообщениеНаСервере();
  	ТекстHTML = ПолучитьТекстМакета();
    ТекстСообщений = ПолучитьСообщенияHTML();
    ТекстHTML = СтрЗаменить(ТекстHTML, "<!--MESSAGES-->", ТекстСообщений);
    
    Элементы.ПолеHTML.Документ.open();
    Элементы.ПолеHTML.Документ.write("");
    Элементы.ПолеHTML.Документ.close();
    Элементы.ПолеHTML.Документ.write(ТекстHTML);
	
	Элементы.ПолеВводаСообщения.Родитель.ПолеВводаСообщения = "";
КонецПроцедуры


&НаКлиенте
Процедура СсылкаНаЗадачуПриИзменении(Элемент)
	ОбновитьЧат();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

    Если Параметры.Свойство("СсылкаНаЗадачу") Тогда
        Объект.СсылкаНаЗадачу = Параметры.СсылкаНаЗадачу;
    Иначе
        Сообщить("Параметр МойРеквизит не передан!");
	КонецЕсли;
	
КонецПроцедуры
